
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ПересчитатьСуммовыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ПересчитатьСуммовыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммовыеПоказатели()
	
	СтрокаТовара = Элементы.Товары.ТекущиеДанные;
	
	Если СтрокаТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТовара.Сумма = СтрокаТовара.Количество * СтрокаТовара.Цена;	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

